src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://entities.logsearch.example.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:SearchInfo>
            <gs:regularExpression>""</gs:regularExpression>
            <gs:dateInterval>
                <gs:dateFrom>2018-01-09T10:15:30</gs:dateFrom>
                <gs:dateTo>2018-02-09T10:15:30</gs:dateTo>
            </gs:dateInterval>
            <gs:location>target</gs:location>
        </gs:SearchInfo>
    </soapenv:Body>
</soapenv:Envelope>
